---

C#Visual BasicVisual C++

Revit 2024 API
---
Transform..::..Multiply Method
Transform Class See Also Send Feedback
---

Multiplies this transformation by the specified transformation and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public Transform Multiply(
    	Transform right
    )

Visual Basic
---

    Public Function Multiply ( _
    	right As Transform _
    ) As Transform

Visual C++
---

    public:
    Transform^ Multiply(
    	Transform^ right
    )

#### Parameters

right
    Type: Autodesk.Revit.DB..::..TransformThe specified transformation.

#### Return Value

The transformation equal to the composition of the two transformations.

# Remarks

The combined transformation has the same effect as applying the right transformation first, and the left transformation, second. So, (T1(T2(p)) = (T1 * T2) (p).

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the handle of the specified transformation is nullNothingnullptra null reference (Nothing in Visual Basic). |

# See Also

Transform Class

Autodesk.Revit.DB Namespace